{ "articles": [{
    "title": "Samsung Galaxy Note 9 review: more, more, more",
    "author": "Dan Seifert",
    "imageLink": "note9.jpg",
    "tag": ["Tech", "Google", "Mobile", "Reviews"],
    "body": "Samsung’s Galaxy Note phones have always been about more. More screen, more battery, more specs, more power, more features; if you want more of something, the Note is the phone to get. It’s a phone designed and built for the power user who won’t settle for anything less."
  }, {
    "title": "NASA is prepared if a battery ever explodes in space",
    "author": "Loren Grush",
    "imageLink": "nasa.jpg",
    "tag": ["Science", "Space"],
    "body": "This maybe sound obvious, but you can’t charge your spacecraft with an extra long power cord — which is why batteries are clutch for space, powering everything from electric tools and spacesuits to satellites and planetary rovers. But sending a battery into the cosmos means more than just loading it onto a rocket: batteries must be built to withstand the extreme temperatures of the space environment, and they also have to be packaged so that they don’t harm any astronauts if they accidentally explode."
  }, {
    "title": "Apple reportedly reaches deal with third-party reseller to allow authorized iPhone repairs",
    "author": "Nick Statt",
    "imageLink": "cracked-iphone.jpg",
    "tag": ["Apple", "Mobile", "Tech"],
    "body": "Apple and Simply Mac, a third-party Apple reseller and service provider, have reached a deal that will see the iPhone maker provide the necessary hardware to let Simply Mac conduct authorized screen repairs, according to a report from 9to5Mac. "
  }, {
    "title": "Inside Imogen Heap’s cutting-edge VR concert",
    "author": "Dani Deahl",
    "imageLink": "vr-concert.jpg",
    "tag": ["Tech", "Virtual Reality", "Culture", "Music"],
    "body": "In the first episode of The Future of Music, I attended an Imogen Heap concert... by putting on an Oculus virtual reality headset. This concert, which takes place in a VR model of her childhood home, is a collaboration between Heap and Los Angeles-based company TheWaveVR. While Heap sings, I walk around, wave at, talk to, and make friends with other people in the room who are represented by cute animal avatars like a fox or bunny. The kicker to all this: I’m not watching Imogen Heap perform but a 3D hologram-like version of her."
  }, {
    "title": "Scooter companies are trying to rehabilitate their reputations as cities crack down",
    "author": "Andrew J. Hawkins",
    "imageLink": "scooter.jpg",
    "tag": ["Transportation", "Rideables", "Ride-Sharing"],
    "body": "After flooding dozens of cities with tens of thousands of pay-per-minute electric two-wheelers, the bike and scooter companies have hit a snag: cities are increasingly passing new rules to regulate their use. As part of their effort to get into the good graces of regulators and lawmakers writing these rules, the scooter startups are rolling out new products and initiatives that emphasize charitable giving, outreach to low-income communities, and infrastructure improvements. It’s image rehabilitation 101."
  }, {
    "title": "The rock that fell to Earth",
    "author": "Brendan Borrell",
    "imageLink": "meteor.jpg",
    "tag": ["Longform"],
    "body": "For eight seconds, an eerie orange glow lit up the mesas and canyons of western Colorado with the intensity of the full Moon. Locals reported a bluish orb in the sky that burst into a yellow ball of flames and dissipated over the Gunnison Gorge, located 10 miles east of the city of Montrose. Moments later, they heard a crackling followed by a low rumble."
  }, {
    "title": "Facebook’s content moderation efforts face increasing skepticism",
    "author": "Casey Newton",
    "imageLink": "neural.jpg",
    "tag": ["The Interface", "Facebook", "US & World"],
    "body": "It’s been a big week for tales of content moderation. Last Friday, Radiolab posted a fascinating episode about Facebook’s evolving approach to deciding what stays on the platform. The episode used a series of historical debates inside the company to illuminate the many challenges faced by a company seeking to regulate speech globally."
  }, {
    "title": "Google adds Xbox One controller support to Android Pie",
    "author": "Tom Warren",
    "imageLink": "controller.jpg",
    "tag": ["Microsoft", "Google", "Gaming", "Circuit Breaker"],
    "body": "Microsoft’s Xbox One controllers haven’t always worked well with Android. While Microsoft added Bluetooth to the Xbox One controllers two years ago, a number of games have had issues with button mapping. Google is now officially supporting Xbox One controllers with Bluetooth in its latest Android Pie release. XDA-Developers reports that a Google engineer has closed a long standing bug report on the Xbox One controller mapping issues, noting that they’re fixed in Android Pie."
  }]
}
