constructor(public title:string, public author: string, public imageLink: string, public category: string, public subCategory: string, public body: string) { }

{ "articles": [{
    "title": "Samsung Galaxy Note 9 review: more, more, more",
    "author": "Dan Seifert",
    "imageLink": "note9.jpg",
    "category": "Tech",
    "subCategory": "Android",
    "body": "Samsung’s Galaxy Note phones have always been about more. More screen, more battery, more specs, more power, more features; if you want more of something, the Note is the phone to get. It’s a phone designed and built for the power user who won’t settle for anything less.

The new Note 9 gives the most more of any Note phone. It has the biggest screen, the fastest processor, the biggest battery, the largest storage, and the most features.

And it also costs the most — the Note 9 starts at $1,000 and goes up to an eye-watering $1,250. It’s easily the most expensive Samsung smartphone ever sold in the US and the most expensive Android phone on the market right now. To get the most, you’ll have to pay the most.

What the Note 9 doesn’t offer is anything new — unlike Note phones of prior years, it doesn’t debut any new technology or design ideas. It just takes everything that Samsung’s been doing with the past few versions of its phones and turns it all up a notch.

I don’t think this lack of new stuff is necessarily a bad thing — the Note 9 is the best phone Samsung has ever made and arguably the best Android phone you can buy right now. But it’s not for everyone."
  }, {
    "title": "NASA is prepared if a battery ever explodes in space",
    "author": "Loren Grush",
    "imageLink": "nasa.jpg",
    "category": "Science",
    "subCategory": "Space",
    "body": "This maybe sound obvious, but you can’t charge your spacecraft with an extra long power cord — which is why batteries are clutch for space, powering everything from electric tools and spacesuits to satellites and planetary rovers. But sending a battery into the cosmos means more than just loading it onto a rocket: batteries must be built to withstand the extreme temperatures of the space environment, and they also have to be packaged so that they don’t harm any astronauts if they accidentally explode.

Many deep-space vessels are equipped with solar panels for power, so most space batteries are used for storing energy on spacecraft to use when the Sun is out of sight. That happens when these vehicles temporarily pass between a planet and the Sun, for instance, blocking light from view. Batteries are crucial for keeping the vehicle powered until sunlight remerges. But batteries also power the life support systems on astronauts’ spacesuits, as well as tools and other portable electric items needed to repair the outside of the International Space Station."
  }]
}
